Управление_по_целям_и_KPI/src/Documents/KPI_ОпределениеЦелей/KPI_ОпределениеЦелей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>KPI_ОпределениеЦелей</name>
  <registerRecords>InformationRegister.KPI_СоответствиеЦелейИПоказателей</registerRecords>
  <tabularSections>
    <name>СписокЦелей</name>
    <attributes>
      <name>Цель</name>
      <type>
        <types>CatalogRef.KPI_Цели</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокПоказателей</name>
    <attributes>
      <name>Цель</name>
      <type>
        <types>CatalogRef.KPI_Цели</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦелевойПоказатель</name>
      <type>
        <types>CatalogRef.KPI_ЦелевыеПоказатели</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_по_целям_и_KPI/src/Documents/KPI_ОпределениеЦелей/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Перем мКолвоСтрокЦП;


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	мКолвоСтрокЦП = Объект.СписокПоказателей.Количество();
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьЦП(Команда)
	Если Элементы.СписокЦелей.ТекущиеДанные <> Неопределено Тогда
		Если Не ЗначениеЗаполнено(Элементы.СписокЦелей.ТекущиеДанные.Цель) Тогда
			Сообщить("Значение цели в списке целей не заполнено");
			Возврат;
		КонецЕсли;
		
		НовСтр = Объект.СписокПоказателей.Добавить();
		НовСтр.Цель = Элементы.СписокЦелей.ТекущиеДанные.Цель;
		
		ОбновитьСтрокиЦелевыхПоказателей(Элементы.СписокЦелей.ТекущиеДанные.Цель);
		
		Элементы.СписокПоказателей.ТекущаяСтрока = мКолвоСтрокЦП;
		Элементы.СписокПоказателей.ИзменитьСтроку();
		
		мКолвоСтрокЦП = мКолвоСтрокЦП + 1;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СписокЦелейПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		ОбновитьСтрокиЦелевыхПоказателей(Элемент.ТекущиеДанные.Цель);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьСтрокиЦелевыхПоказателей(Цель)
	Если Элементы.СписокЦелей.ТекущиеДанные <> Неопределено Тогда 
		ПараметрыОтбора = Новый Структура("Цель", Цель);
		Элементы.СписокПоказателей.ОтборСтрок = Новый ФиксированнаяСтруктура(ПараметрыОтбора);	
		
		Элементы.СписокПоказателей.Обновить();
		Элементы.СписокЦелей.Обновить();
	КонецЕсли;
КонецПроцедуры	


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//найдем цели без целевых показателей
	Для каждого Стр Из Объект.СписокЦелей Цикл
		Структура = Новый Структура("Цель", Стр.Цель);
		ЗависимыеЦП = Объект.СписокПоказателей.НайтиСтроки(Структура);
		Если ЗависимыеЦП.Количество() = 0 Тогда
			Сообщить("Для цели """ + Стр.Цель + """ не выбраны целевые показатели");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура УдалитьЦель(Команда)
	Если Элементы.СписокЦелей.ТекущиеДанные <> Неопределено Тогда 
		УдалитьЦельИЗависимыеЦП(Элементы.СписокЦелей.ТекущиеДанные.Цель);
		Элементы.СписокПоказателей.Обновить();
		Элементы.СписокЦелей.Обновить();
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура УдалитьЦельИЗависимыеЦП(ТекЦель)
	НачатьТранзакцию();
	
	//удалим цели
	ц = 0;
	Пока ц < Объект.СписокЦелей.Количество() Цикл
		Если Объект.СписокЦелей.Получить(ц).Цель = ТекЦель Тогда
			Объект.СписокЦелей.Удалить(ц);
		Иначе 
			ц = ц + 1;	
		КонецЕсли;
	КонецЦикла;
	
	//удалим целевые показатели
	н = 0;
	Пока н < Объект.СписокПоказателей.Количество() Цикл
		Если Объект.СписокПоказателей.Получить(н).Цель = ТекЦель Тогда
			Объект.СписокПоказателей.Удалить(н);
		Иначе 
			н = н + 1;	
		КонецЕсли;
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
КонецПроцедуры


&НаКлиенте
Процедура СписокЦелейЦельОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	//проверим на повторный выбор уже выбранного значения
	Структура = Новый Структура("Цель", ВыбранноеЗначение);
	
	ПовторяющаясяЦель = Объект.СписокЦелей.НайтиСтроки(Структура);
	
	Если ПовторяющаясяЦель.Количество() > 0 Тогда
		Сообщить("Цель """ + ВыбранноеЗначение + """ уже существует в списке целей");
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СписокПоказателейЦелевойПоказательОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	//проверим на повторный выбор уже выбранного значения
	Структура = Новый Структура;
	Структура.Вставить("Цель", Элементы.СписокЦелей.ТекущиеДанные.Цель);
	Структура.Вставить("ЦелевойПоказатель", ВыбранноеЗначение);
	
	ПовторяющийсяЦП = Объект.СписокПоказателей.НайтиСтроки(Структура);
	
	Если ПовторяющийсяЦП.Количество() > 0 Тогда
		Сообщить("Целевой показатель """ + ВыбранноеЗначение + """ уже существует в списке целевых показателей");
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
КонецПроцедуры
